export interface Centenses {
    texts: string[];               // ひらがな
}

// 難易度レベル
export type Level = 'Easy' | 'Normal' | 'Hard';
const Easy: Centenses = {
    texts: [
        "いぬ",
        "ねこ",
        "とり",
        "さかな",
        "うま",
        "うし",
        "ぶた",
        "ひつじ",
        "りんご",
        "みかん",
        "ぶどう",
        "もも",
        "さくら",
        "いちご",
        "すいか",
        "たこす",
        "ぴざ",
        "こめ",
        "さーばー",
        "きーぼーど",
        "まうす",
        "ぱそこん",
        "さば",
        "ぬるぽ"
    ]
};
const Normal: Centenses = {
    texts: [
        "せぐふぉ",
        "あいおーえす",
        "あんどろいど",
        "うぃんどうず",
        "りなっくす",
        "まっくおーえす",
        "べーしっく",
        "ぱすかる",
        "じゃばすくりぷと",
        "たいぷすくりぷと",
        "ちゃーはん4びっと",
        "しーしゃーぷ",
        "いんたーなるさーばーえらー",
        "やきにくていしょく",
        "すーぱーまりおぶらざーず",
        "どらごんふるーつ",
        "あいすくりーむ",
        "こーひーあいす",
        "ちょこれーとけーき",
        "こんでんえいねんしざいほう",
        "ぐんぶだいじんげんえきぶかんせい",
        "とうきょうとっきょきょかきょく",
        "だけんあつ"
    ]
};
const Hard: Centenses = {
    texts: [
        "ふろーとがたは32びっとのふどうしょうすうてん",
        "えーあいをもちいたにそくほこうのろぼっと",
        "すいいてきかんすうじゅうぞくせい",
        "えんたーていんめんとこんぴゅーてぃんぐ2026",
        "あなろぐきーぼーどをもちいただけんあつせんしんぐにもとづくたいぴんぐげーむ",
        "まいんくらふとにおけるけんちくてきいしょうをいかしたぼくせるでふぉるめへんかんしゅほうのていあん",
        "かんこうちにおけるかおはめぱねるとれんどうしたでじたるかぷせるといしすてむのていあん",
        

    ]
};
const SENTENCES: Record<Level, Centenses> = {
    Easy,
    Normal,
    Hard
};
export default SENTENCES;
